In [43]:
import numpy as np
import pandas as pd

people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [44]:
df = pd.DataFrame(people)

df.columns = df.columns.str.title()

In [46]:
df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)
# df.replace(None, np.nan, inplace=True)

In [48]:
# ðŸŽ¯ What's the difference between None vs. np.nan?
# âœ… Are they both treated as isnull().mean() - YES. They are

df

   First     Last                    Email   Age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [50]:
# Count the percentage % of missing values -> isnull()
# ðŸ§  df.isnull().mean()

(df.isnull().mean() * 100).round(4)

First    42.8571
Last     42.8571
Email    42.8571
Age      42.8571
dtype: float64

In [55]:
# Check the entire data frame for na values
# ðŸ§  df.isna()

df.isna()

   First   Last  Email    Age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [18]:
# ðŸ§  df.dropna()

df.dropna(axis='index', how='any')

   First     Last                    Email      Age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [57]:
# Mass fill missing data with string or integer ('MISSING', 0)
# ðŸ§  df.fillna()

df.fillna('MISSING_Input')

           First           Last                    Email            Age
0          Corey        Schafer  CoreyMSchafer@gmail.com             33
1           Jane            Doe        JaneDoe@email.com             55
2           John            Doe        JohnDoe@email.com             63
3          Chris        Schafer            MISSING_Input             36
4  MISSING_Input  MISSING_Input            MISSING_Input  MISSING_Input
5  MISSING_Input  MISSING_Input      Anonymous@email.com  MISSING_Input
6  MISSING_Input  MISSING_Input            MISSING_Input  MISSING_Input

In [20]:
df.dropna(axis='columns', how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [21]:
df.dropna(axis='index', how='all')  # Drop row ONLY if the entire row is missing contents

   First     Last                    Email      Age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [22]:
df.dropna(axis='columns', how='all')

   First     Last                    Email      Age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

First    28.5714
Last     28.5714
Email    28.5714
Age      28.5714
dtype: float64

In [27]:
# Drop a specific column with condition

df.dropna(axis='index', how='any', subset=['Email'])

   First     Last                    Email      Age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [42]:
df.dropna(axis='index', how='all', subset=['Email', 'Last'])  # .loc[6, 'Age']

   First     Last                    Email      Age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing